app/controllers/church_rings_controller.rb

  def index
    @church_rings = ChurchRing.all
---
SELECT "church_rings".* FROM "church_rings"

  def create
    @church_ring = ChurchRing.new(church_ring_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @church_ring.save
---
INSERT INTO "church_rings" ("name", "size", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Piekne"], ["size", 12], ["created_at", 2016-08-28 15:08:42 UTC], ["updated_at", 2016-08-28 15:08:42 UTC]]

  def update
    respond_to do |format|
      if @church_ring.update(church_ring_params)
---
UPDATE "church_rings" SET "size" = ?, "updated_at" = ? WHERE "church_rings"."id" = ?  [["size", 13], ["updated_at", 2016-08-28 15:09:00 UTC], ["id", 1]]

    def set_church_ring
      @church_ring = ChurchRing.find(params[:id])
---
SELECT  "church_rings".* FROM "church_rings" WHERE "church_rings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]