app/controllers/church_decorations_controller.rb

  def index
    @church_decorations = ChurchDecoration.all
---
SELECT "church_decorations".* FROM "church_decorations"

  def create
    @church_decoration = ChurchDecoration.new(church_decoration_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @church_decoration.save
---
INSERT INTO "church_decorations" ("name", "colour", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Roze"], ["colour", "biale"], ["amount", 10], ["created_at", 2016-08-28 14:29:08 UTC], ["updated_at", 2016-08-28 14:29:08 UTC]]

  def update
    respond_to do |format|
      if @church_decoration.update(church_decoration_params)
---
UPDATE "church_decorations" SET "colour" = ?, "updated_at" = ? WHERE "church_decorations"."id" = ?  [["colour", "Niebieskie"], ["updated_at", 2016-08-28 14:29:35 UTC], ["id", 2]]

    def set_church_decoration
      @church_decoration = ChurchDecoration.find(params[:id])
---
SELECT  "church_decorations".* FROM "church_decorations" WHERE "church_decorations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]