app/controllers/church_ceremonies_controller.rb

  def index
    @church_ceremonies = ChurchCeremony.all
---
SELECT "church_ceremonies".* FROM "church_ceremonies"

  def create
    @church_ceremony = ChurchCeremony.new(church_ceremony_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @church_ceremony.save
---
INSERT INTO "church_ceremonies" ("name", "adress", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Kosciol sw.Maksymiliana"], ["adress", "Gdynia, Konwaliowa"], ["date", 2016-08-26 14:00:00 UTC], ["created_at", 2016-08-28 14:10:21 UTC], ["updated_at", 2016-08-28 14:10:21 UTC]]

    def set_church_ceremony
      @church_ceremony = ChurchCeremony.find(params[:id])
---
SELECT  "church_ceremonies".* FROM "church_ceremonies" WHERE "church_ceremonies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]