app/controllers/groom_suits_controller.rb

  def index
    @groom_suits = GroomSuit.all
---
SELECT "groom_suits".* FROM "groom_suits"

  def create
    @groom_suit = GroomSuit.new(groom_suit_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @groom_suit.save
---
INSERT INTO "groom_suits" ("model", "size", "fitting", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["model", "Pok"], ["size", 10], ["fitting", 2016-08-28 21:47:00 UTC], ["created_at", 2016-08-28 21:48:02 UTC], ["updated_at", 2016-08-28 21:48:02 UTC], ["user_id", 1]]

  def update
    respond_to do |format|
      if @groom_suit.update(groom_suit_params)
---
UPDATE "groom_suits" SET "fitting" = ?, "updated_at" = ? WHERE "groom_suits"."id" = ?  [["fitting", 2016-08-29 17:08:00 UTC], ["updated_at", 2016-08-28 17:08:29 UTC], ["id", 1]]

  def destroy
    @groom_suit.destroy
---
DELETE FROM "groom_suits" WHERE "groom_suits"."id" = ?  [["id", 2]]

    def set_groom_suit
      @groom_suit = GroomSuit.find(params[:id])
---
SELECT  "groom_suits".* FROM "groom_suits" WHERE "groom_suits"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]