app/controllers/guests_controller.rb

SELECT "guests".* FROM "guests"
---
  def index
    @guests = Guest.all

INSERT INTO "guests" ("name", "subname", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Antek"], ["subname", "Majtek"], ["description", "+ Asia Kasia"], ["created_at", 2016-08-28 11:14:45 UTC], ["updated_at", 2016-08-28 11:14:45 UTC]]
---
  def create
    @guest = Guest.new(guest_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @guest.save

UPDATE "guests" SET "invitation_sent" = ?, "invitation_confirmed" = ?, "updated_at" = ? WHERE "guests"."id" = ?  [["invitation_sent", true], ["invitation_confirmed", false], ["updated_at", 2016-08-28 13:08:38 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @guest.update(guest_params)

DELETE FROM "guests" WHERE "guests"."id" = ?  [["id", 2]]
---
  def destroy
    @guest.destroy

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_guest
      @guest = Guest.find(params[:id])