app/controllers/wedding_rooms_controller.rb

SELECT "wedding_rooms".* FROM "wedding_rooms"
---
  def index
    @wedding_rooms = WeddingRoom.all

INSERT INTO "wedding_rooms" ("name", "adress", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Blanka"], ["adress", "Maopolska"], ["created_at", 2016-08-28 16:20:34 UTC], ["updated_at", 2016-08-28 16:20:34 UTC]]
---
  def create
    @wedding_room = WeddingRoom.new(wedding_room_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @wedding_room.save

UPDATE "wedding_rooms" SET "adress" = ?, "updated_at" = ? WHERE "wedding_rooms"."id" = ?  [["adress", "Malopolska"], ["updated_at", 2016-08-28 16:20:48 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @wedding_room.update(wedding_room_params)

SELECT  "wedding_rooms".* FROM "wedding_rooms" WHERE "wedding_rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_wedding_room
      @wedding_room = WeddingRoom.find(params[:id])