app/controllers/wedding_services_controller.rb

SELECT "wedding_services".* FROM "wedding_services"
---
  def index
    @wedding_services = WeddingService.all

INSERT INTO "wedding_services" ("who", "name", "contact", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["who", "DJ"], ["name", "DJ Slawek"], ["contact", "123456789"], ["created_at", 2016-08-28 16:43:42 UTC], ["updated_at", 2016-08-28 16:43:42 UTC]]
---
  def create
    @wedding_service = WeddingService.new(wedding_service_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @wedding_service.save

SELECT  "wedding_services".* FROM "wedding_services" WHERE "wedding_services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_wedding_service
      @wedding_service = WeddingService.find(params[:id])